Revit 2026 API

# PointOnPlaneGetPlaneReference Method

---

The geometric plane reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetPlaneReference()
```
```vb
Public Function GetPlaneReference As Reference
```
```cpp
public:
Reference^ GetPlaneReference()
```
```fsharp
member GetPlaneReference : unit -> Reference
```

#### Return Value

ReferenceA copy of the reference stored in the PointOnPlane object.

#### Reference

PointOnPlane Class

Autodesk.Revit.DB Namespace